celebrity_data = {
    'Insec': {
        'line': 'TOP',
        'desc': '전 프로게이머로 정글로 프로 생활을 지속하였지만, 은퇴 후 탑으로 포지션을 전향하였다. 유튜브를 보면 깜짝 킬 캐치를 잘해 솔킬을 자주 따는 모습을 볼 수 있다.',
        'url': 'https://www.youtube.com/@inSec93'
    },
    'oyo': {
        'line': 'TOP',
        'desc': '볼리베어 권위자이다. 시즌과 메타가 변할 때 가장 먼저 볼리베어 템트리를 개발해내고 있으며, 볼리베어에 대한 TMI를 100가지 이상 알고 있다.',
        'url': 'https://www.youtube.com/@_OYO_'
    },
    'destiny': {
        'line': 'UTILITY',
        'desc': '선수 시절 항상 쓰레쉬를 밴 당할 정도로 쓰레쉬 실력이 좋다. 안정적인 운영과 수 싸움을 좋아하는 편이며, 실제 선수들과의 라인전에서도 뒤쳐지지 않는 모습을 보여준다.',
        'url': 'https://www.youtube.com/@destiny4863'
    },
    'Zeus': {
        'line': 'TOP',
        'desc': '대한민국 국가대표 탑라이너다. 칼챔과 탱챔을 가리지 않는 넓은 챔프 폭을 가졌으며, 어떤 구도가 와도 밀리지 않고 솔킬을 자주 따내는 선수이다. 뛰어난 판단력과 피지컬을 기반으로 현재 대한민국 1등 탑라이너다.',
        'url': 'https://www.youtube.com/@SKTT1'
    },
    'Kingen': {
        'line': 'TOP',
        'desc': '아마추어 시절부터 탑 장인으로 럼블,제이스 같은 공격적인 챔피언을 잘 다뤘다. 강한 성향의 챔피언을 다루는 특성 상 피지컬을 이용한 공격적인 플레이를 잘 보여주고 있다. 하지만 후반에 집중력이 떨어지는 모습을 자주 보여 아쉬움이 있다.',
        'url': 'https://www.youtube.com/@HanwhaLifeEsports'
    },
    'Thal': {
        'line': 'TOP',
        'desc': '전 프로게이머 출신으로 트런들 장인으로 유명하다. 라인전을 강하게 하는 타입이 아닌, 한타 능력과 게임 센스가 뛰어난 아웃복서형 탑솔러다.',
        'url': 'https://www.youtube.com/@thalyoutube877'
    },
    'paka': {
        'line': 'TOP',
        'desc': ' 게임 센스가 매우 뛰어난 편이며, 화려한 플레이를 자주 보여준다. 하지만, 화려함과 쓰로잉은 한 끗 차이이며 모아니면 도의 플레이를 하는 줄타기 선수이다.',
        'url': 'https://www.youtube.com/@paka2'
    },
    'Irelking': {
        'line': 'MIDDLE',
        'desc': '이렐리아 장인으로 매우 유명한 플레이어다. 실제로 프로게이머들을 만나도 전혀 밀리지 않는 모습을 볼 수 있고, 쇼메이커에게 인정을 받은 적이 있다. 이렐리아,아칼리와 같은 공격적인 챔피언을 주로 하고, 손이 엄청 빠른 편이다.',
        'url': 'https://www.youtube.com/@ireliaking'
    },
    'Soondangmoo': {
        'line': 'UTILITY',
        'desc': '상당히 (워딩이) 공격적인 선수이다. 한국 최초의 롤 여성 프로게이머이고, 과로사라는 비제이의 여동생으로 유명했다. 첫 리그에서 좋은 성적을 거두지 못했지만, 준수한 실력을 보여주며 팬들의 적극적인 지지를 받고 있다.',
        'url': 'https://www.youtube.com/@SOONDANGMOO'
    },
    'Kanavi': {
        'line': 'JUNGLE',
        'desc': '2023 아시안게임 국가대표 정글로 참여한 선수이다. 상당한 성장 능력과 시간이 지날수록 상대팀 정글과의 격차를 벌리는게 특기이다. 또한, 중국으로 넘어가 리그 1등을 달성했고, 이번 아시안게임에서도 금메달을 따냈다. 현재 세계 1위 정글러라 봐도 무방할만큼의 커리어를 갖고 있다.',
        'url': 'https://www.youtube.com/watch?v=BinfYbIUQmE'
    },
    'The Shy': {
        'line': 'TOP',
        'desc': '2018년 세계 최고의 탑솔러에 등극하며 본격적으로 최정상급 선수로 자리매김 하였고 그 이후에도 매 시즌 눈에 띄는 활약을 보여주었다. 전성기의 더샤이는 중국,한국 모든 나라에서 우상이었으며 특히 중국에서 엄청난 지지를 얻고 있다. 하지만 고점과 저점의 차이가 심하고, 저점을 찍은 판에는 푸짐하게 싼다.',
        'url': 'https://www.youtube.com/@theshy_official'
    },
    'Pz_zzang': {
        'line': 'MIDDLE',
        'desc': '야스오, 요네 장인으로 매우 유명한 플레이어다. 실제로 프로게이머들을 만나도 전혀 밀리지 않는 모습을 볼 수 있고, 쇼메이커에게 인정을 받은 적이 있다. 야스오,요네와 같은 공격적인 챔피언을 주로 하고 손이 엄청 빠른 편이다.',
        'url': 'https://www.youtube.com/@pzzzang3'
    },
    'Baekk': {
        'line': 'MIDDLE',
        'desc': '르블랑, 아칼리, 카시오페아를 굉장히 잘하기로 유명하다. 특히 르블랑의 경우 프로들에게도 인정 받은 모습을 보여줬고, 실제로 맞라인을 섰을 때 우위를 가져가는 모습또한 많이 볼 수 있었다. 절대로 무리를 하지 않는 특징이 있고, 라인전이 상당히 강력해 1:1을 지는 경우는 잘 없다.',
        'url': 'https://www.youtube.com/@Baekk'
    },
    'Showmaker': {
        'line': 'MIDDLE',
        'desc': '쇼메이커의 플레이는 마치 흐르는 물과도 같다. 언제든지 그는 상대를 혼자 꺾을 수 있는 챔피언을 쓸 수도 있다. 또 필요하다면, 뛰어난 팀원들의 약점을 메워주는 픽도 가능하다. 2019년을 제패했던 미드 라이너들로부터 쇼메이커는 담원을 위한 로밍 플레이어가 된다는게 무엇인지 완벽히 숙달했고, 그가 필요한 때에 그는 항상 그 곳에 있었다.',
        'url': 'https://www.youtube.com/@DplusKIA_LOL'
    },
    'Ruler': {
        'line': 'BOTTOM',
        'desc': '아시안게임 국가대표 원딜러이자, 현재 세계 최고 원딜러라 평가받는 선수이다. 상당히 공격적이지만, 안정적이다. 과감한 모습을 보여주지만 그와 동시에 안정적으로 플레이하여 팀을 승리로 이끈다. 현재는 중국에서 선수 생활 중이며, 이번 롤드컵때 가장 무서운 선수로 뽑히기도 했다.',
        'url': 'https://www.youtube.com/watch?v=BWnrpR-1s08'
    }
}



